<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class MovieSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    $movies = [
      [
        'name' => 'Зеленая миля',
        'description' => '"Зеленая миля" - история, рассказанная по воспоминаниям. Пол Эджкомб, работавший во времена Великой депрессии охранником блока смертников в исправительной тюрьме Cold Mountain, провожал многих преступников в их последний путь от камеры до электрического стула по длинному, выстеленному зеленым линолеумом коридору.\nГод за годом Эджкомб сопровождал по "миле" разных людей. Но он ни разу не встречался ни с кем, подобным Джону Коффи - огромным чернокожим мужчиной, осужденным за жестокое убийство двух девятилетних сестер...',
        'country' => 'США',
        'duration' => 189,
        'poster' => '../../img/posters/green-mile.jpeg',
      ],
      [
        'name' => 'Властелин колец: Возвращение короля',
        'description' => 'Армия Сарумана повержена, и теперь всё внимание приковано к Гондору. Повелитель сил тьмы Саурон направляет свою бесчисленную армию под стены Минас-Тирита, крепости Последней Надежды. Он предвкушает близкую победу, но именно это мешает ему заметить две крохотные фигурки - хоббитов, приближающихся к Роковой Горе, где им предстоит уничтожить Кольцо Всевластья.',
        'country' => 'Новая Зеландия, США',
        'duration' => 201,
        'poster' => '../../img/posters/lord-of-the-rings-return.jpeg',
      ],
      [
        'name' => 'Начало',
        'description' => 'Дом Кобб — талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил. И вот у Кобба появляется шанс исправить ошибки. Его последнее дело может вернуть все назад, но для этого ему нужно совершить невозможное — инициацию. Вместо идеальной кражи Кобб и его команда спецов должны будут провернуть обратное. Теперь их задача — не украсть идею, а внедрить ее. Если у них получится, это и станет идеальным преступлением.\nНо никакое планирование или мастерство не могут подготовить команду к встрече с опасным противником, который, кажется, предугадывает каждый их ход. Врагом, увидеть которого мог бы лишь Кобб.',
        'country' => 'США, Великобритания',
        'duration' => 148,
        'poster' => '../../img/posters/inception.jpeg',
      ],
      [
        'name' => 'Бойцовский клуб',
        'description' => 'Главный герой картины, служащий большой автомобильной компании, мучается от бессонницы и обязательств, накладываемых на него работой и его социальным статусом. Случайное знакомство с анархистом Тайлером Дерденом приводит его к открытию подпольного клуба, где посвященные получают возможность в кулачном бою избавиться от раздражения и злобы, связанных с осознанием замкнутого круга рабского потребления и рекламы, собственного ничтожества и невозможности стать звездой или миллионером. Несмотря на жесткие правила, запрещающие кому бы то ни было рассказывать о бойцовском клубе, слухи о новом радикальном объединении ширятся, и вот уже по всей стране открываются бойцовские клубы, грозящие перерасти в мощную террористическую организацию, целью которой является мировая анархия.',
        'country' => 'США, Германия',
        'duration' => 139,
        'poster' => '../../img/posters/fight-club.jpeg',
      ],
      [
        'name' => 'Матрица',
        'description' => 'Жизнь Томаса Андерсона разделена на две части: днём он — самый обычный офисный работник, получающий нагоняи от начальства, а ночью превращается в хакера по имени Нео, и нет места в сети, куда он не смог бы дотянуться. Но однажды всё меняется — герой, сам того не желая, узнаёт страшную правду: всё, что его окружает — не более, чем иллюзия, Матрица, а люди — всего лишь источник питания для искусственного интеллекта, поработившего человечество. И только Нео под силу изменить расстановку сил в этом чужом и страшном мире.',
        'country' => 'США, Австралия',
        'duration' => 136,
        'poster' => '../../img/posters/matrix.jpeg',
      ],
      [
        'name' => 'Брат',
        'description' => 'Демобилизованный из армии, Данила Багров вернулся в родной городок. Но скучная жизнь российской провинции не устраивала его, и он решился податься в Петербург, где, по слухам, уже несколько лет процветает его старший брат. Данила нашел брата. Но все оказалось не так просто — брат был наемным убийцей…',
        'country' => 'Россия',
        'duration' => 100,
        'poster' => '../../img/posters/brother.jpeg',
      ],
      [
        'name' => 'Крестный отец',
        'description' => 'Криминальная сага, повествующая о нью-йоркской сицилийской мафиозной семье Корлеоне. Фильм охватывает период 1945—1955 годов. Глава семьи, Дон Вито Корлеоне, выдаёт замуж свою дочь. В это время со Второй мировой войны возвращается его любимый сын Майкл. Майкл, герой войны, гордость семьи, не выражает желания заняться жестоким семейным бизнесом. Дон Корлеоне ведёт дела по старым правилам, но наступают иные времена, и появляются люди, желающие изменить сложившиеся порядки. На Дона Корлеоне совершается покушение.',
        'country' => 'США',
        'duration' => 175,
        'poster' => '../../img/posters/the-godfather.jpeg',
      ],
      [
        'name' => 'Аладдин',
        'description' => 'Признанный мастер авантюрных комедий и искрометных диалогов Гай Ричи представляет новый художественный фильм Disney «Аладдин», вдохновленный классическим анимационным фильмом легендарной студии. Зрителей ждет увлекательное путешествие в Аграбу и встреча с любимыми героями: отважным Аладдином, обезьяной-воришкой Абу, удивительным и неунывающим Джином, независимой и гордой принцессой Жасмин, коварным визирем султана Джафаром и его помощником говорящим попугаем Яго!',
        'country' => 'США, Великобритания, Австралия',
        'duration' => 128,
        'poster' => '../../img/posters/aladdin.jpeg',
      ],
      [
        'name' => 'Стражи Галактики',
        'description' => 'Когда в руки Питера попадает таинственный артефакт, принадлежащий могущественному и безжалостному злодею Ронану, Квилл оказывается в центре межгалактической охоты, где жертва – он сам. Единственный способ справиться с надвигающейся угрозой – объединиться с командой непохожих друг на друга героев: воинственным енотом по кличке Ракета, человекоподобным деревом Грутом, смертельно опасной Гаморой и одержимым жаждой мести Драксом, также известным как Разрушитель. Квилл понимает, какой силой обладает украденный артефакт и какую опасность он представляет для Вселенной, и теперь он пойдет на все, чтобы сплотить случайных союзников для решающей битвы за судьбу галактики.',
        'country' => 'США',
        'duration' => 121,
        'poster' => '../../img/posters/guardians-of-the-galaxy.jpeg',
      ],
      [
        'name' => 'Джуманджи: Новый уровень',
        'description' => 'Чтобы спасти одного из приятелей, остальным приходится вернуться в игру. К их удивлению, правила Джуманджи изменились, и все идет наперекосяк. Чтобы выжить друзьям предстоит отправиться в путешествие по самым неизведанным и таинственным уголкам игры — от засушливой пустыни до заснеженных гор.',
        'country' => 'США',
        'duration' => 123,
        'poster' => '../../img/posters/jumanji-the-next-level.jpeg',
      ],
    ];

    DB::table('movies')->insert($movies);
  }
}
